In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
import seaborn as sns
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [2]:
filepath = '../data/'
df = pd.read_csv( filepath +'grade.csv', index_col=0 )
df

     과목   결과  중간  기말
학년
1학년  국어   좋음  80  90
1학년  국어   나쁨  50  40
1학년  국어   나쁨  20  50
1학년  수학   좋음  83  95
1학년  수학   좋음  93  86
2학년  국어   나쁨  44  65
2학년  국어   좋음  95  98
2학년  수학   좋음  96  99
2학년  수학   나쁨  57  69

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 1학년 to 2학년
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   과목      9 non-null      object
 1   결과      9 non-null      object
 2   중간      9 non-null      int64
 3   기말      9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 360.0+ bytes

## pivot_table( )
- Create a spreadsheet-style pivot table as a DataFrame. 
- The levels in the pivot table will be stored in MultiIndex objects(hierarchical indexes) on the index and columns of the result DataFrame.

In [7]:
df.pivot_table( index ='과목', aggfunc='mean')

       기말     중간
과목
국어  68.60  57.80
수학  87.25  82.25

In [6]:
df.groupby( '과목' ).mean()

       중간     기말
과목
국어  57.80  68.60
수학  82.25  87.25

In [19]:
df.pivot_table( index='학년', aggfunc='mean' )
# 숫자형 데이터의 평균을 구해준다.

        기말    중간
학년
1학년  72.20  65.2
2학년  82.75  73.0

In [20]:
df.groupby('학년').mean()

       중간     기말
학년
1학년  65.2  72.20
2학년  73.0  82.75

In [21]:
df.groupby('학년').agg( 'mean' )

       중간     기말
학년
1학년  65.2  72.20
2학년  73.0  82.75

## 멀티 인덱스

### Q.학년별 과목별 값을 보고싶다면
- groupby( [ '학년' , '과목' ] )
- pivot_table( index=[ '학년' , '과목' ] )

In [23]:
df.groupby(['학년','과목']).mean()

          중간    기말
학년  과목
1학년 국어  50.0  60.0
    수학  88.0  90.5
2학년 국어  69.5  81.5
    수학  76.5  84.0

In [27]:
df.pivot_table( index=['학년','과목'], aggfunc='mean' )[['중간','기말']]

          중간    기말
학년  과목
1학년 국어  50.0  60.0
    수학  88.0  90.5
2학년 국어  69.5  81.5
    수학  76.5  84.0

### Q. 특정 컬럼의 값만 보고 싶을 때
- values= 인자 주기

In [28]:
df.pivot_table( index='학년', aggfunc='mean', values='중간' )

       중간
학년
1학년  65.2
2학년  73.0

In [33]:
df.pivot_table( index=['학년','과목'] , values='중간', columns='결과' )
# 학년별 과목별, 중간고사의 결과를 알 수 있음

결과        나쁨    좋음
학년  과목
1학년 국어  35.0  80.0
    수학   NaN  88.0
2학년 국어  44.0  95.0
    수학  57.0  96.0

In [39]:
df.pivot_table(index='학년', aggfunc=['mean','sum'])

      mean        sum
        기말    중간   기말   중간
학년
1학년  72.20  65.2  361  326
2학년  82.75  73.0  331  292

### Q.내가 원하는대로 집계하고자 한다면

In [24]:
def p_or_np( v ):
#     print('v= ', v) # 각 1학년 중간고사에 해당하는 값들이 시리즈로 나옴
    if v.mean() >= 70:
        return '합격'
    else:
        return '불합격'

# df.groupby('학년').apply(p_or_np)
df.pivot_table(index='학년', values='중간',aggfunc=['mean',p_or_np] )

     mean p_or_np
       중간      중간
학년
1학년  65.2     불합격
2학년  73.0      합격

In [56]:
df.pivot_table(index='학년', values='중간',aggfunc=p_or_np)

      중간
학년
1학년  불합격
2학년   합격

In [59]:
df.pivot_table( index='학년',
                values='중간',
                aggfunc=lambda x: '합격' if x.mean() >= 70 else '불합격'
              )

      중간
학년
1학년  불합격
2학년   합격